In [1]:
import pandas as pd


avocado_df = pd.read_csv('Resources/Avocado.csv')

In [2]:
avocado_df['region'].unique()

array(['Albany', 'Atlanta', 'Baltimore/Washington', 'BaltimoreWashington',
       'Boise', 'Boston', 'Buffalo/Rochester', 'BuffaloRochester',
       'California', 'Charlotte', 'Chicago', 'Cincinnati/Dayton',
       'CincinnatiDayton', 'Columbus', 'Dallas/Ft. Worth',
       'DallasFtWorth', 'Denver', 'Detroit', 'Grand Rapids',
       'GrandRapids', 'Great Lakes', 'GreatLakes', 'Harrisburg/Scranton',
       'HarrisburgScranton', 'Hartford/Springfield',
       'HartfordSpringfield', 'Houston', 'Indianapolis', 'Jacksonville',
       'Las Vegas', 'LasVegas', 'Los Angeles', 'LosAngeles', 'Louisville',
       'Miami/Ft. Lauderdale', 'MiamiFtLauderdale', 'Midsouth',
       'Nashville', 'New Orleans/Mobile', 'New York', 'NewOrleansMobile',
       'NewYork', 'Northeast', 'Northern New England',
       'NorthernNewEngland', 'Orlando', 'Philadelphia', 'Phoenix/Tucson',
       'PhoenixTucson', 'Pittsburgh', 'Plains', 'Portland',
       'Raleigh/Greensboro', 'RaleighGreensboro', 'Richmond/Norfolk',
       'RichmondNorfolk', 'Roanoke', 'Sacramento', 'San Diego',
       'San Francisco', 'SanDiego', 'SanFrancisco', 'Seattle',
       'South Carolina', 'South Central', 'SouthCarolina', 'SouthCentral',
       'Southeast', 'Spokane', 'St. Louis', 'StLouis', 'Syracuse',
       'Tampa', 'Total U.S.', 'TotalUS', 'West', 'West Tex/New Mexico',
       'WestTexNewMexico'], dtype=object)

In [3]:
avocado_df['region'] = avocado_df['region'].replace(
    {'LosAngeles': 'Los Angeles', 'BaltimoreWashington': 'Baltimore/Washington', 'BuffaloRochester': 'Buffalo/Rochester', 'CincinnatiDayton': 'Cincinnati/Dayton', 'DallasFtWorth': 'Dallas/Ft. Worth', 'GrandRapids': 'Grand Rapids', 'GreatLakes': 'Great Lakes', 'HarrisburgScranton': 'Harrisburg/Scranton', 'HartfordSpringfield': 'Hartford/Springfield', 'Harford/Springfield': 'Hartford/Springfield', 'LasVegas': 'Las Vegas', 'MiamiFtLauderdale': 'Miami/Ft. Lauderdale', 'NewOrleansMobile': 'New Orleans/Mobile', 'NewYork': 'New York', 'NorthernNewEngland': 'Northern New England', 'PhoenixTucson': 'Phoenix/Tucson', 'RaleighGreensboro': 'Raleigh/Greensboro', 'RichmondNorfolk': 'Richmond/Norfolk', 'SanDiego': 'San Diego', 'SanFrancisco': 'San Francisco', 'SouthCarolina': 'South Carolina', 'SouthCentral': 'South Central', 'StLouis': 'St. Louis', 'Total U.S.': 'Total US', 'TotalUS': 'Total US', 'WestTexNewMexico': 'West Tex/New Mexico'})

In [4]:
avocado_df['region'].unique()

array(['Albany', 'Atlanta', 'Baltimore/Washington', 'Boise', 'Boston',
       'Buffalo/Rochester', 'California', 'Charlotte', 'Chicago',
       'Cincinnati/Dayton', 'Columbus', 'Dallas/Ft. Worth', 'Denver',
       'Detroit', 'Grand Rapids', 'Great Lakes', 'Harrisburg/Scranton',
       'Hartford/Springfield', 'Houston', 'Indianapolis', 'Jacksonville',
       'Las Vegas', 'Los Angeles', 'Louisville', 'Miami/Ft. Lauderdale',
       'Midsouth', 'Nashville', 'New Orleans/Mobile', 'New York',
       'Northeast', 'Northern New England', 'Orlando', 'Philadelphia',
       'Phoenix/Tucson', 'Pittsburgh', 'Plains', 'Portland',
       'Raleigh/Greensboro', 'Richmond/Norfolk', 'Roanoke', 'Sacramento',
       'San Diego', 'San Francisco', 'Seattle', 'South Carolina',
       'South Central', 'Southeast', 'Spokane', 'St. Louis', 'Syracuse',
       'Tampa', 'Total US', 'West', 'West Tex/New Mexico'], dtype=object)

In [5]:
junk_cities = ['Baltimore/Washington', 'Buffalo/Rochester', 'Cincinnati/Dayton', 'Dallas/Ft. Worth', 'Harrisburg/Scranton', 'Hartford/Springfield', 'Miami/Ft. Lauderdale', 'New Orleans/Mobile', 'Northeast', 'Phoenix/Tucson', 'Raleigh/Greensboro', 'Richmond/Norfolk', 'South Central', 'Southeast', 'West', 'West Tex/New Mexico', 'Total US', 'California', 'Mid South']
clean_df =avocado_df
for city in junk_cities:
    clean_df.drop(clean_df.loc[clean_df['region']==city].index, inplace=True)

In [6]:
clean_df['region'].unique()

array(['Albany', 'Atlanta', 'Boise', 'Boston', 'Charlotte', 'Chicago',
       'Columbus', 'Denver', 'Detroit', 'Grand Rapids', 'Great Lakes',
       'Houston', 'Indianapolis', 'Jacksonville', 'Las Vegas',
       'Los Angeles', 'Louisville', 'Midsouth', 'Nashville', 'New York',
       'Northern New England', 'Orlando', 'Philadelphia', 'Pittsburgh',
       'Plains', 'Portland', 'Roanoke', 'Sacramento', 'San Diego',
       'San Francisco', 'Seattle', 'South Carolina', 'Spokane',
       'St. Louis', 'Syracuse', 'Tampa'], dtype=object)

In [7]:
clean_df.to_csv('Resources/clean_avocado.csv')

In [8]:
clean_df['year'].unique()

array([2015, 2016, 2017, 2018, 2019], dtype=int64)

In [9]:
#matching names to other CSV files and to clarify what state
clean_df['region'] = clean_df['region'].replace({'Albany': 'Albany, NY', 'Atlanta': 'Atlanta, GA', 'Boise': 'Boise City, ID', 'Boston': 'Boston, MA', 
                                          'Charlotte': 'Charlotte, NC','Chicago': 'Chicago, IL', 'Columbus': 'Columbus, OH', 'Denver': 'Denver, CO', 
                                          'Detroit': 'Detroit, MI', 'Grand Rapids': 'Grand Rapids, MI', 'Houston': 'Houston, TX', 
                                          'Indianapolis': 'Indianapolis, IN', 'Jacksonville': 'Jacksonville, FL', 'Las Vegas': 'Las Vegas, NV', 
                                          'Los Angeles': 'Los Angeles, CA', 'Nashville': 'Nashville, NC', 'New York': 'New York, NY', 'Orlando': 
                                          'Orlando, FL', 'Philadelphia': 'Philadelphia, PA', 'Pittsburgh': 'Pittsburgh, PA', 'Portland': 'Portland, OR', 
                                          'Roanoke': 'Roanoke, VA', 'Sacramento': 'Sacramento, CA', 'San Diego': 'San Diego, CA', 
                                          'San Francisco': 'San Francisco, CA', 'Seattle': 'Seattle, WA', 'Spokane':'Spokane, WA', 
                                          'St. Louis': 'St.Louis, MO', 'Syracuse': 'Syracuse, NY', 'Tampa': 'Tampa, FL'})

In [10]:
clean_df

,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,1/4/2015,1.22,40873.28,2819.50,28287.42,49.90,9716.46,9186.93,529.53,0.0,conventional,2015,"Albany, NY"
1,1/11/2015,1.24,41195.08,1002.85,31640.34,127.12,8424.77,8036.04,388.73,0.0,conventional,2015,"Albany, NY"
2,1/18/2015,1.17,44511.28,914.14,31540.32,135.77,11921.05,11651.09,269.96,0.0,conventional,2015,"Albany, NY"
3,1/25/2015,1.06,45147.50,941.38,33196.16,164.14,10845.82,10103.35,742.47,0.0,conventional,2015,"Albany, NY"
4,2/1/2015,0.99,70873.60,1353.90,60017.20,179.32,9323.18,9170.82,152.36,0.0,conventional,2015,"Albany, NY"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
26560,11/3/2019,0.96,10247.59,264.26,0.00,0.00,9983.33,9983.33,0.00,0.0,organic,2019,"Tampa, FL"
26561,11/10/2019,1.23,9234.00,209.00,1.00,0.00,9024.00,9024.00,0.00,0.0,organic,2019,"Tampa, FL"
26562,11/17/2019,1.26,7134.00,287.00,0.00,0.00,6847.00,6847.00,0.00,0.0,organic,2019,"Tampa, FL"
26563,11/24/2019,1.24,7257.00,187.00,2.00,0.00,7068.00,7068.00,0.00,0.0,organic,2019,"Tampa, FL"
26564,12/1/2019,1.17,6957.00,126.00,0.00,0.00,6831.00,6831.00,0.00,0.0,organic,2019,"Tampa, FL"

In [11]:
clean_df.drop(clean_df.loc[clean_df['year']==2019].index, inplace=True)

In [12]:
clean_df

,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,1/4/2015,1.22,40873.28,2819.50,28287.42,49.90,9716.46,9186.93,529.53,0.0,conventional,2015,"Albany, NY"
1,1/11/2015,1.24,41195.08,1002.85,31640.34,127.12,8424.77,8036.04,388.73,0.0,conventional,2015,"Albany, NY"
2,1/18/2015,1.17,44511.28,914.14,31540.32,135.77,11921.05,11651.09,269.96,0.0,conventional,2015,"Albany, NY"
3,1/25/2015,1.06,45147.50,941.38,33196.16,164.14,10845.82,10103.35,742.47,0.0,conventional,2015,"Albany, NY"
4,2/1/2015,0.99,70873.60,1353.90,60017.20,179.32,9323.18,9170.82,152.36,0.0,conventional,2015,"Albany, NY"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
26512,11/4/2018,1.49,8300.71,152.99,521.23,0.00,7626.49,6953.34,673.15,0.0,organic,2018,"Tampa, FL"
26513,11/11/2018,1.54,9113.31,136.55,670.58,0.00,8306.18,7048.18,1258.00,0.0,organic,2018,"Tampa, FL"
26514,11/18/2018,1.52,12259.52,220.91,1231.73,0.00,10806.88,7333.34,3473.54,0.0,organic,2018,"Tampa, FL"
26515,11/25/2018,1.24,710.36,52.13,25.74,0.00,632.49,567.77,64.72,0.0,organic,2018,"Tampa, FL"
26516,12/2/2018,1.29,7374.15,176.32,5.44,0.00,7192.39,7192.39,0.00,0.0,organic,2018,"Tampa, FL"

In [13]:
clean_df.to_csv('Resources/clean_avocado.csv', index= False)